app/controllers/complaints_controller.rb

  def index
    @complaints = Complaint.all
---
SELECT * FROM "complaints"

  def show
    @complaint = Complaint.find(params[:id])
---
SELECT * FROM "complaints" WHERE ("complaints"."id" = 1)

  def edit
    @complaint = Complaint.find(params[:id])
---
SELECT * FROM "complaints" WHERE ("complaints"."id" = 1)

  def create
    @complaint = Complaint.new(params[:complaint])

    respond_to do |format|
      if @complaint.save
---
INSERT INTO "complaints" ("created_at", "updated_at", "description") VALUES('2010-04-17 18:33:13', '2010-04-17 18:33:13', 'Oh swami please help me with this problem I currently have.')