app/controllers/platitudes_controller.rb

SELECT * FROM "platitudes"
---
  def index
    @platitudes = Platitude.all

SELECT * FROM "platitudes" WHERE ("platitudes"."id" = 1)
---
  def show
    @platitude = Platitude.find(params[:id])

INSERT INTO "platitudes" ("created_at", "updated_at", "user_id", "personality_id", "platitude") VALUES('2010-04-17 19:21:10', '2010-04-17 19:21:10', NULL, NULL, 'Something Is really Wrong With You')
---
  def create
    @platitude = Platitude.new(params[:platitude])

    respond_to do |format|
      if @platitude.save